---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingNotConnected
source: html/6a4b793d-61b5-4b88-3c38-cab89bc4a8ad.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RailingNotConnected Property

The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingNotConnected { get; }
```